interface Aya {
    ayaNumber: number,
    highlighterId:string,
    styles: number[],
    isSingleHighlighter: boolean
}
interface AyaTafseer {
    highlighterId: string,
    text:string
}

export const QuranDataPageDetails: Aya[] = [
    {
        ayaNumber: 6,
        highlighterId: '6',
        styles: [370, 42, 50], // width, top, left,
        isSingleHighlighter: false
    },
    {
        ayaNumber: 6,
        highlighterId: '6_1',
        styles: [70, 42, 160], // width, top, left,
        isSingleHighlighter: true
    },
    {
        ayaNumber: 6,
        highlighterId: '6',
        styles: [66, 85, 350], // width, top, left,
        isSingleHighlighter: false
    }
]

export const QuranDataPageTafseerDetails: AyaTafseer[] = [
    {
        highlighterId: '6',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.'
    },
    {
        highlighterId: '6_1',
        text: 'يعتقدون بجهلهم أنهم يخادعون الله والذين آمنوا بإظهارهم الإيمان وإضمارهم الكفر، وما يخدعون إلا أنفسهم؛ لأن عاقبة خداعهم تعود عليهم. ومِن فرط جهلهم لا يُحِسُّون بذلك؛ لفساد قلوبهم.'
    },
    {
        highlighterId: '7',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    },
    {
        highlighterId: '8',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    },
    {
        highlighterId: '9',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    },
    {
        highlighterId: '10',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    },
    {
        highlighterId: '11',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    },
    {
        highlighterId: '12',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    },
    {
        highlighterId: '13',
        text: '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
            '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
            '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    }
]
