type QuranDataType = Record<string, number[][]>

// this will return page aya with highlighters properties
/*
* rules
*
* */
export const QuranData: QuranDataType = {
    '2_6': [ // sura_aya
        [370, 42, 50], // width, top, left, isHasSingleTafseer 0,1
        [70, 42, 160, 1],
        [66, 85, 350]
    ],
    '2_7': [
        [285, 88, 50],
        [255, 126, 165]
    ]
}


export const QuranPageTafseer: Record<string, string> = {
    '2_6': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    '2_6_2': 'يعتقدون بجهلهم أنهم يخادعون الله والذين آمنوا بإظهارهم الإيمان وإضمارهم الكفر، وما يخدعون إلا أنفسهم؛ لأن عاقبة خداعهم تعود عليهم. ومِن فرط جهلهم لا يُحِسُّون بذلك؛ لفساد قلوبهم.',
    '2_7': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    '2_8': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    '2_9': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    '2_10': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    '2_11': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.',
    '2_12': '     واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه\n' +
        '            يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويبقون الإناث على\n' +
        '  قيد الحياة ذليلات، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم.'
}
